/*==============================================
	■■■ 정렬(Sort) 알고리즘 ■■■
-선택 정렬(Selection Sort): 가장 왼편으로 비교
================================================*/
/*
○정렬
	: 데이터를 특정한 규칙(기준)에 맞게 순서대로 나열 (오름차순,내림차순)
	
○정렬의 목적
  : 데이터 처리 과정의 편의성이나 가독성을 높이기 위함
	=> 보기 좋게...! 검색하기 위함

○정렬의 종류
	: 선택 정렬/버블 정렬/ 삽입 정렬/ 힙 정렬/ 퀵 정렬/ 쉘 정렬

//실행 예)
//Source Data : 52 42 12 62 60
//Sorted Data : 12 42 52 60 62
//계속하려면 아무 키나 누르세요..



*/
public class Test103
{
	public static void main(String [] args)
	{
		int[] a = {52, 42, 12, 62, 60};
/*
		52 42 12 62 60			0 0						          i->0
		== --																j -> 1

		42 52 12 62 60			0 1											j -> 2	
		== --
																			j -> 3
		12 52 42 62 60			0 2
		==    --															j -> 4

		12 52 42 62 60			0 3
		==       --

		12 52 42 62 60			0 4
		==          --
	-------------------------------------------------------------1회전 ==>(제일 작은 12 고정)
		12 42 52 62 60			1 2
		   == --

		12 42 52 62 60			1 3
		   ==    --

		12 42 52 60 62			1 4
		   ==       --
----------------------------------------------------------------2회전 ==> 42 고정
		12 42 52 62 60			2 3
		      == --

		12 42 52 60 62			2 4
		      ==    --   
----------------------------------------------------------------3회전	==> 52고정

		12 42 52 60 62			3 4
		         == --
----------------------------------------------------------------4회전	==> 60고정
*/	
	
			//주요 변수 선언
			int i, j, temp;
			
			System.out.print("Source Data : ");
			/*
				for (i=0; i<a.length; i++)	
				System.out.print(a[i] + " ");
				System.out.println();
			*/
			//==>Source Data : 52 42 12 62 60

			//향상된 for문(forEach 구문)
			for ( int n :a )
			
				System.out.print(n + " ");
			System.out.println();
			//==>Source Data : 52 42 12 62 60

			// Selection Sort 구현
		for (i=0; i<a.length-1; i++)		//-- 비교 기준 데이터 0 1 2 3 (-1 : 마지막은 안해도 돼서 뺌)
		{
			for (j=i+1; j<a.length; j++)	//-- 비교 기준 데이터 1 2 3 4 (끝까지 돌아야해서 -1 안함)
			{
				// (a[i] < a[j]) : 내림차순
				if (a[i] > a[j])		//-- a[i] > a[j] 일 경우 자리바꿈 (오름차순)
				{
						//자리 바꾸기
						a[i] = a[i]^a[j];
						a[i] = a[j]^a[i];
						a[i] = a[i]^a[j];
						
					}
				}
			}
		

			System.out.print("Sorted Data : ");
			/*
			for (i=0;i<a.length ;i++ )
				System.out.print(a[i] + " ");
			System.out.println();
			*/
			//--==>> Sprted Data : 52 42 12 62 60

			//향상된 for문(forEach 구문)
			for ( int n :a )
			
				System.out.print(n + " ");
			System.out.println();
		   //==>>Sorted Data : 52 42 12 62 60
	}

}
/*
Source Data : 52 42 12 62 60
Sorted Data : 18 38 12 2 60
계속하려면 아무 키나 누르십시오 . . .				다시 풀기~~~~~~~~~~~~~~~~Sorted Data값이 이상함!
*/

