/*=============================
연산자(operator)
-비트 단위 연산자 『~ 물결 모양_비트 부정』
==============================*/
public class Test021
{
	public static void main(String[] args)
	{
		int a =10, b = -10;

		System.out.printf("~a ; %d\n", ~a);			//
		System.out.printf("~b : %d\n", ~b);			//
	}
}
/*
실행결과
~a ; -11
~b : 9
계속하려면 아무 키나 누르십시오 . . .
*/

/* 처리과정☞
a=10 ☞00001010 ☞ ~a ☞ 11110101 ☞-11☞check? ☞ok
                        +00001011 ☞11
						-----------------
                         00000000 ☞0

b=-10 ☞ 10= 00001010 ☞ 2의보수 ☞1의 보수(비트열 반전) +1 ☞
			 
			 11110110 ☞-10
			+00001010 ☞10 
			----------
			 00000000 ☞0

			 11110110
	(비트반전) 00001001☞9
*/